Catalogs/СотрудникиБИА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СотрудникиБИА</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Comment>Дата, с которой запись о сотруднике считается действительной. </Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Comment>Дата, с которой запись о сотруднике считается недействительной. </Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Comment>Занимаемая сотрудником должность.</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДолжностьБИА</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодразделениеБИА</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоОсновнойСотрудникФизЛица</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СотрудникиБИА/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Наименование = Строка(ФизическоеЛицо)
		+ ПредставлениеСтруктурнойЕдиницыИДолжностиСотрудника(Подразделение, Должность);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПредставлениеСтруктурнойЕдиницыИДолжностиСотрудника(Подразделение, Должность)
	
	Если Не ЗначениеЗаполнено(Подразделение) И Не ЗначениеЗаполнено(Должность) Тогда
		Возврат "";
	КонецЕсли;
	
	Представление = "";
	Если ЗначениеЗаполнено(Подразделение) И ЗначениеЗаполнено(Должность) Тогда 
		Представление = СтрШаблон(" (%1, %2)", Строка(Подразделение), Строка(Должность));
	ИначеЕсли ЗначениеЗаполнено(Подразделение) Тогда
		Представление = СтрШаблон(" (%1)", Строка(Подразделение));
	ИначеЕсли ЗначениеЗаполнено(Должность) Тогда 	
		Представление = СтрШаблон(" (%1)", Строка(Должность));
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

#КонецОбласти

#КонецЕсли
